app/controllers/api/v1/group_events_controller.rb

SELECT "group_events".* FROM "group_events"
---
  def index
    render json: GroupEvent.all

INSERT INTO "group_events" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hola"], ["user_id", 1], ["created_at", 2016-11-27 21:00:03 UTC], ["updated_at", 2016-11-27 21:00:03 UTC]]
---
  def create
    # with authentication the first line of this method
    # would be the line bellow instead of the actual one
    #
    # group_event = current_user.events.build(group_event_attrs)

    group_event = GroupEvent.new(group_event_attrs.merge(user_id: 1))

    if group_event.save

UPDATE "group_events" SET "name" = ?, "updated_at" = ? WHERE "group_events"."id" = ?  [["name", "group event name"], ["updated_at", 2016-11-21 22:33:28 UTC], ["id", 1]]
---
  def update
    @group_event.assign_attributes(group_event_attrs.merge(user_id: 1))

    if @group_event.save

SELECT  "group_events".* FROM "group_events" WHERE "group_events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_group_event
      # with authentication finding the group even would be as shown bellow.
      #
      # @group_event = current_user.events.find(params[:id])

      @group_event = GroupEvent.find(params[:id])